validation/prepare_ref/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
6241
(
(4.0756e-06 -4.06545e-06 0)
(2.55653e-05 -8.20543e-06 0)
(4.93261e-05 -6.54835e-06 0)
(6.18759e-05 -1.23933e-06 0)
(5.32542e-05 4.79525e-06 0)
(2.30266e-05 1.12414e-05 0)
(-3.67986e-05 1.83262e-05 0)
(-0.000112749 2.41542e-05 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    fixedWalls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
